app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "aaaaaaaaaaaaa"], ["message_id", 9], ["user_id", 1], ["created_at", "2019-07-02 06:28:55.813184"], ["updated_at", "2019-07-02 06:28:55.813184"]]
---
	def create

		@comment = @message.comments.create(comment_params)
		@comment.user_id = current_user.id

		if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?
---
	def update
		if @comment.update(comment_params)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def find_message
		 @message =Message.find(params[:message_id])

SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT ?  [["message_id", 9], ["id", 2], ["LIMIT", 1]]
---
	def find_comment
		@comment=@message.comments.find(params[:id])