app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
	def index
		@messages= Message.all.order("created_at DESC")

INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		# @message=Message.new(message_params)
		@message=current_user.messages.build(message_params)

		if @message.save

UPDATE "messages" SET "title" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "Team Manager Sacked...!!"], ["updated_at", "2019-07-01 14:30:25.667646"], ["id", 9]]
---
	def update
		if @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 9]]
---
	def destroy
		@message.destroy

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def find_message
		@message=Message.find(params[:id])